[
    {
        "date": "2025-04-07",
        "details": "Inspired by the octopus, Prof. Rob SCHARFF's team has developed artificial suction cups that can grasp objects and sense their surroundings. The artificial suction cups could enable the implementation of octopus-inspired manipulation strategies in soft continuum robot arms. The research conducted by first author Stein VAN VEGGEL (TU Delft) was a collaboration between HKUST, Delft University of Technology (TU Delft), and the Italian Institute of Technology (IIT). \n\n\n\nPublished in Advanced Intelligent Systems, the paper titled “Optoelectronically Innervated Suction Cup Inspired by the Octopus” introduces a 3D-printed octopus-inspired suction cup with integrated colored markers. Tactile information is collected using an embedded camera that captures the displacement of these markers upon contact between the suction cup and its environment. This information could be employed to accurately estimate the orientation of the suction cup with respect to an object surface. The effectiveness of the approach was demonstrated in a closed-loop control scheme where the suction cup could successfully pick up randomly oriented objects by approaching the object surface perpendicularly.  \n\n\n \nThe work was motivated by the findings from a literature review on artificial suction cups by the same authors published in Advanced Science. In this work, titled “Classification and Evaluation of Octopus-Inspired Suction Cups for Soft Continuum Robots”, the authors identified the lack of high-resolution tactile sensors for artificial suction cups as one of the major hurdles towards the realization of octopus-like dexterous manipulation capabilities in soft continuum robot arms.",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 1,
        "pictures": ["/src/assets/newsEvt/news.2025.04.07.jpg"],
        "title": "Collaboration on Implementation of Octopus-inspired Manipulation Strategies in Soft Continuum Robot Arms with Artificial Suction Cups",
        "type": "News"
    },
    {
        "date": "2024-03-28",
        "details": "xTx HKUST student team – ENTERPRIZE was awarded the 1st runner up in the RoboMaster University League (RMUL) 2024. 3 talented students from ISD were part of the core members of the team.  xETx We are so proud of you! \n\n\n\nThe RMUL, which leads by Shenzhen academic institutes and universities, aims to build a community to promote the exchange of robotics technology and support young innovators in the Greater Bay Area. HKUST team enrolled into 3V3 Match, where each team needs to develop Standard, Hero and Sentry robots independently and engage in tactical combat in the designated battlefield. The team with the highest remaining Base HP wins. This year, 8 university teams from Shenzhen and Hong Kong participated in the game, making it even more hostile. \n\n\n\nAfter several rounds of hard matches, ENTERPRIZE was one of the strongest teams with high remaining Base HP and was awarded the 1st runner up. They have demonstrated excellent robotic control techniques and deployed combating strategies during the game. Hope that they can keep the spirit up and fight with the best in future. Let’s share our respect and love to ENTERPRIZE!",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 3,
        "pictures": ["/src/assets/newsEvt/ach.2024.03.08.jpg"],
        "title": "HKUST Student Team Awarded 1st Runner Up in the RoboMaster University League (RMUL)",
        "type": "Achievements"
    },
    {
        "date": "2024-10-29",
        "details": "The modern urban built environment has been a contributor to the social, health and ecological crises faced by cities around the world, while the emergence of artificial intelligence and the new multi-polar global order present both opportunities and existential threats. To address these crises, it is imperative for the architecture and creative profession to take up the social responsibility through more conscious design, bridging the gaps between abstract data and human empathy, between the authorities and the communities, and between technology and everyday life. It is in these contexts that the research laboratory Social Urban Lab (SOULab) and design consultancy COLOURS: Collectively Ours were set up as complementary practice to investigate the people-environment dynamics and translate data-driven, community-based research into evidence-based design for health, equity, agency and urban life. In this talk, Dr Chong will also share how he envisions the future of creative education in the Intelligent Age.\n\n\n\nxTx Speaker’s biography: xETx \n\n\n\nDr. Chong Keng Hua is currently Associate Professor of Architecture and Sustainable Design at the Singapore University of Technology and Design (SUTD), where he directs the Social Urban Lab (SOULab), DesignZ Positive City Lab, and the Opportunity Lab (O-Lab). He is also Founding Partner of COLOURS: Collectively Ours, an award-winning design consultancy specializing in public space and social impact, as well as Visiting Senior Academician at Changi General Hospital, Singapore. He will be the Provost and Vice President (Academic) of Nanyang Academy of Fine Arts (NAFA) at the newly established University of the Arts Singapore (UAS). \n\n\n\nA firm believer in design activism, Dr. Chong has been advocating social architecture and participatory community design in the region. He initiated PARK(ing) Day Singapore in 2013 together with his students, which has since become a nation-wide annual placemaking movement. He has also led students to work on community development projects in Cambodia, Vietnam, Thailand, and China. He is active in several international organisations, including Pacific Rim Community Design Network, and Design for the Common Good International Network.\n\n\n\nDr. Chong’s research on social architecture particularly in the areas of ageing, health and data-driven community design has led to extensive international publications, including Second Beginnings (Lien Foundation, 2018), Creative Ageing Cities (Routledge, 2018) and upcoming book Data-driven Smart Community Design (Routledge, 2025). Design interventions led by him have won numerous awards, including the latest Seoul Design Award 2024.\n\n\n\nGraduated with PhD in Architecture from National University of Singapore, Dr. Chong has been Visiting Professor at Aalto University, Massachusetts Institute of Technology (MIT) and Zhejiang University. He was Curator of Singapore Pavilion at Seoul Biennale 2017 and Venice Biennale 2018, as well as Festival Director of Singapore Archifest 2020.\n\n\n",
        "evt_date": "2024-10-29",
        "evt_location": "Room 5619 (Lift 31 & 32), Academic Building, HKUST",
        "evt_time": "17:00",
        "id": 4,
        "pictures": ["/src/assets/newsEvt/evt.2024.10.29.png"],
        "title": "[ISD Seminar] Smart Community Design: Education, Research & Practice for Social Change in the Intelligent Age",
        "type": "Events"
    },
    {
        "date": "2025-07-02",
        "details": "July 2–12, 2025 | HKUST x Dongguan Songshan Lake \n\n\n\nInnoBay Summer Camp 2025, was a transformative innovation bootcamp jointly hosted by the Division of Integrative Systems and Design of Hong Kong University of Science and Technology and strategic partners across the Greater Bay Area. The programme brought together undergraduate and postgraduate talents from various countries and over a dozen disciplines, all united by a passion for marine technology, sustainable solutions, and entrepreneurship. \n\n\n\nOver ten immersive days, participants journeyed from the state-of-the-art HKUST campus in Clear Water Bay to the advanced manufacturing ecosystem at Dongguan Songshan Lake. The camp’s curriculum fused deep dives into design thinking, rapid prototyping, user research, and commercialization, with field visits and mentorship from technology leaders.  \n\n\n\nThrough InnoBay Summer Camp, students experienced marine innovation from multiple perspectives: exploring Ocean Park’s animal habitats and workshops revealed the intricate care required for captive marine life, while direct engagement with Aberdeen’s fishing community provided invaluable, real-world insights into traditional fishing practices, vessel maintenance, and the operational realities of Hong Kong’s coastal industry. \n\n\nxTx What made the camp unique? xETx\n\n\n\nReal-World Problem Solving: Students tackled critical marine challenges, including aquaculture monitoring, red tide prediction, sustainable fisheries, and underwater communication. \n\n\n\nInterdisciplinary Collaboration: The camp paired coders, designers, biologists, and engineers to break down silos and build integrated, deployable hardware-software systems. \n\n\n\nMentor-Led Acceleration: Each team had access to industry mentors and research leaders, many of whom fast-tracked project pilots and provided direct feedback. \n\n\n\nField Exposure: Tours of leading manufacturing and testing facilities, and talks with founders, gave participants a window into real innovation and supply chain integration in the Greater Bay Area. \n\n\n\nxTx 📸 Spotlight Projects & Teams xETx\n\n\n\n🐟 AQUAREE: Real-time aquarium monitoring on mobile app for “Bubbles the Clownfish”\n\n\n\n🌊 RT SHIELD: Red tide simulated response at test pond; three-stage active defense\n\n\n\n👁️ SirenX: Live underwater talk test with OLED scroll screen\n\n\n\n🎥 Strike-Cam: Catch footage streamed from 2km offshore rig—AI auto-tracked!\n\n\n\nPlease refer to the project catalog here InnoBay2025 Project Catalog.pdf for more information.\n\n\n🔮 Looking Ahead\n\n\n\nWe believe the success of InnoBay Summer Camp 2025 as an idea-to-product accelerator has emboldened participants to strive for impact in their diverse fields of study and entrepreneurial ventures. As HKUST and ISD continue to spearhead youth technology entrepreneurship and foster greater inter-university collaboration, we are open to conversations with like-minded university and industry partners. \n\n\n\nFor more information, please reach out to us at isd@ust.hk. \n",
        "evt_date": "2025-07-02",
        "evt_location": "HKUST Campus (July 2-8) → Dongguan (July 8-12)",
        "evt_time": null,
        "id": 5,
        "pictures": ["/src/assets/newsEvt/evt.2025.07.02.png"],
        "title": "HKUST InnoBay Bootcamp 2025: Your Gateway to Innovation and Entrepreneurship",
        "type": "Events"
    },
    {
        "date": "2025-10-14",
        "details": "This year, we have nine ISD faculty members recognized as being in the world’s Top 2% of the Most-Cited Scientists for 2025! xTx Career-long & Single-year Impact xETx Prof. Song GUO\nProf. Mo LI\nProf. Chi Ying TSUI\nProf. Qian ZHANG xTx Career-long Impact xETx\nProf. Zexiang LI xTx Single-year Impact xETx Prof. Arash KAZEMIAN\nProf. Yuan LIU\nProf. Dongfang XU\nProf. Sai Kit YEUNG\n\n\n\nThey are ranked and selected by Stanford University based on their citation scores, out of 100,000 scientists.\nCongratulations on this remarkable achievement and the high level of research excellence! ",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 6,
        "pictures": ["/src/assets/newsEvt/news.2025.15.10.png"],
        "title": "Nine ISD Faculty Members Recognized Among the World’s Top 2% of Most-Cited Scientists for 2025",
        "type": "News"
    },
    {
        "date": "2025-09-02",
        "details": "Prof. Qijia SHAO was selected as an Emerging Rockstar and featured in an interview in IEEE Pervasive Computing magazine (Volume 24, Issue 2, April-June 2025)!\n\n\n\nAs a rising star in the field of Pervasive Computing, Prof. Shao shared his recent research on developing deployable systems to collect and analyze human-related data for understanding human states and addressing real-world challenges in healthcare, education, and entertainment.\n\n\n\nCheck out Prof. Shao's insights and be inspired to pursue a career in ubiquitous computing: http://bit.ly/4nedKW3.",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 7,
        "pictures": ["/src/assets/newsEvt/news.2025.09.02.png"],
        "title": "Prof. Qijia SHAO Selected as Emerging Rockstar in IEEE Pervasive Computing magazine",
        "type": "News"
    },
    {
        "date": "2025-08-21",
        "details": "Minister of Education of China Jinpeng HUAI visited our makerspace, ISDworks! and witnessed our students' innovative achievements during his delegation's visit to HKUST last week.\n\n\n\nThe visit began with our division head Prof. Qian ZHANG sharing the unique pedagogy of ISD in nurturing a new generation of innovative and technological talent, followed by Prof. Zexiang LI's introduction to HKUST’s entrepreneurship education framework. The delegation toured the lab alongside Prof. Harry SHUM, Council Chairman of HKUST and Prof. Nancy IP, President of HKUST, to explore our students’ projects from various courses, expressing great appreciation for their innovation. Both ISD undergraduate and postgraduate students presented their signature projects on \"Drone as First Responder\" and \"Aerial Work Robot\", showcasing our strengths in technological advancement and our commitment to shaping a better world.",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 8,
        "pictures": [
            "/src/assets/newsEvt/news.2025.08.21.01.png",
            "/src/assets/newsEvt/news.2025.08.21.02.png",
            "/src/assets/newsEvt/news.2025.08.21.03.png",
            "/src/assets/newsEvt/news.2025.08.21.04.png",
            "/src/assets/newsEvt/news.2025.08.21.05.png",
            "/src/assets/newsEvt/news.2025.08.21.06.png"
        ],
        "title": "Minister of Education of China Jinpeng HUAI Visited ISDworks!, Witnessed Students' Innovative Achievement in Innovation",
        "type": "News"
    },
    {
        "date": "2025-07-28",
        "details": "July 2–12, 2025 | HKUST x Dongguan Songshan Lake \n\n\n\nInnoBay Summer Camp 2025, was a transformative innovation bootcamp jointly hosted by the Division of Integrative Systems and Design of Hong Kong University of Science and Technology and strategic partners across the Greater Bay Area. The programme brought together undergraduate and postgraduate talents from various countries and over a dozen disciplines, all united by a passion for marine technology, sustainable solutions, and entrepreneurship. \n\n\n\nOver ten immersive days, participants journeyed from the state-of-the-art HKUST campus in Clear Water Bay to the advanced manufacturing ecosystem at Dongguan Songshan Lake. The camp’s curriculum fused deep dives into design thinking, rapid prototyping, user research, and commercialization, with field visits and mentorship from technology leaders.  \n\n\n\nThrough InnoBay Summer Camp, students experienced marine innovation from multiple perspectives: exploring Ocean Park’s animal habitats and workshops revealed the intricate care required for captive marine life, while direct engagement with Aberdeen’s fishing community provided invaluable, real-world insights into traditional fishing practices, vessel maintenance, and the operational realities of Hong Kong’s coastal industry. \n\n\nxTx What made the camp unique? xETx\n\n\n\nReal-World Problem Solving: Students tackled critical marine challenges, including aquaculture monitoring, red tide prediction, sustainable fisheries, and underwater communication. \n\n\n\nInterdisciplinary Collaboration: The camp paired coders, designers, biologists, and engineers to break down silos and build integrated, deployable hardware-software systems. \n\n\n\nMentor-Led Acceleration: Each team had access to industry mentors and research leaders, many of whom fast-tracked project pilots and provided direct feedback. \n\n\n\nField Exposure: Tours of leading manufacturing and testing facilities, and talks with founders, gave participants a window into real innovation and supply chain integration in the Greater Bay Area. \n\n\n\nxTx 📸 Spotlight Projects & Teams xETx\n\n\n\n🐟 AQUAREE: Real-time aquarium monitoring on mobile app for “Bubbles the Clownfish”\n\n\n\n🌊 RT SHIELD: Red tide simulated response at test pond; three-stage active defense\n\n\n\n👁️ SirenX: Live underwater talk test with OLED scroll screen\n\n\n\n🎥 Strike-Cam: Catch footage streamed from 2km offshore rig—AI auto-tracked!\n\n\n\nPlease refer to the project catalog here InnoBay2025 Project Catalog.pdf for more information.\n\n\n🔮 xTx Looking Ahead xETx \n\n\n\nWe believe the success of InnoBay Summer Camp 2025 as an idea-to-product accelerator has emboldened participants to strive for impact in their diverse fields of study and entrepreneurial ventures. As HKUST and ISD continue to spearhead youth technology entrepreneurship and foster greater inter-university collaboration, we are open to conversations with like-minded university and industry partners. \n\n\n\nFor more information, please reach out to us at isd@ust.hk. ",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 9,
        "pictures": [
            "/src/assets/newsEvt/news.2025.07.28.01.png",
            "/src/assets/newsEvt/news.2025.07.28.02.png",
            "/src/assets/newsEvt/news.2025.07.28.03.png",
            "/src/assets/newsEvt/news.2025.07.28.04.png",
            "/src/assets/newsEvt/news.2025.07.28.05.png"
        ],
        "title": "InnoBay Summer Camp 2025 - Turning Marine Innovation into Action in the Greater Bay Area ",
        "type": "News"
    },
    {
        "date": "2025-07-07",
        "details": "Congratulations to our PhD students Tony CHUI and Jacky SHIN on receiving the Red Dot: Best of the Best Design Award 2025! \n\n\n\nJoined the Division under the supervision of Prof. Shenghui SONG and co-founded Novasdyne with Xiao Jian KONG, their company project “Chopstick - Autonomous Embodied AI Robot” introduces an autonomous AI-powered robot built with smart swarm intelligence and human-robot interaction, aiming to address the anticipated challenges of labor shortages driven by the aging population and reluctance for labor-intensive work. It features dual robotic arms to perform complex and repetitive hazardous tasks, an active suspension wheel system, and dual interchangeable batteries complemented by hot-swap battery stations, enabling 24/7 operation. Its deployment would be a new way to enhance productivity! ",
        "evt_date": null,
        "evt_location": null,
        "evt_time": null,
        "id": 10,
        "pictures": [
            "/src/assets/newsEvt/news.2025.07.07.01.jpg",
            "/src/assets/newsEvt/news.2025.07.07.02.jpg",
            "/src/assets/newsEvt/news.2025.07.07.03.jpg",
            "/src/assets/newsEvt/news.2025.07.07.04.jpg"
        ],
        "title": "ISD PhD Students Won Red Dot: Best of the Best Design Award 2025",
        "type": "News"
    },
    {
        "date": "2024-10-22",
        "details": "This talk consists of two parts: the first part introduces the F1tenth and F1/16th teaching platforms for autonomous driving. It includes an ROS 2 simulator and 1/10- or 1/16-scale toy cars equipped with edge computing device and sensors. The teaching modules include reactive algorithms such as gap following and path planning algorithms such as SLAM (Simultaneous Localization and Mapping) and Rapidly-exploring Random Tree (RRT)/RRT*.\n\n\n\nThe second part of the talk introduces the basics of underwater Internet of Thinks and the three means of underwater wireless communication. It also discusses the current state-of-the-art technologies in the PHY layer underwater acoustic communications, such as Single Carrier Coherent Modulation (SCCM), Orthogonal Frequency Division Multiplexing (OFDM), and Orthogonal Time-Frequency Space (OTFS) modulation schemes and their filed applications.\n\n\n\nxTx Speaker’s biography: xxEndTitlexxx \n\n\n\nProf. Yahong Rosa ZHENG received the Ph.D. degree from Carleton University, Ottawa, ONT, Canada, in 2002. She was an NSERC Postdoctoral Fellow for two years with the University of Missouri-Columbia. Then, she was on the faculty of the Department of Electrical and Computer Engineering at the Missouri University of Science and Technology for 13 years. Since Aug. 2018, she has been a professor in the ECE department at Lehigh University. She has developed more than 10 new courses over the last 18 years of college teaching. Her research interests include underwater and underground IoT, wireless communications, wireless sensor networks, compressive sensing, machine learning and robotics. She has served as a Technical Program Committee (TPC) member for many IEEE international conferences. She served as Associate Editor for three IEEE journals and a senior editor for IEEE Vehicular Technology Magazine. She is currently an Associate Editor for the IEEE Journal of Oceanic Engineering. She is the recipient of an NSF faculty CAREER award in 2009. She has been an IEEE fellow and a Distinguished Lecturer of IEEE Vehicular Technology Society since 2015. She has also served on the IEEE Fellow evaluation committee for the IEEE Oceanic Engineering Society since 2018.\n\n",
        "evt_date": "2025-10-22",
        "evt_location": "Room 4503 (Lift 25-26), Academic Building, HKUST",
        "evt_time": "10:00 ",
        "id": 11,
        "pictures": ["/src/assets/newsEvt/evt.2024.10.22.png"],
        "title": "[ISD Seminar] Introduction to F1Tenth Robotic Driving and Underwater Internet of Things ",
        "type": "Events"
    }
]
